from flask import Flask, render_template

app = Flask(__name__)

@app.route('/')
def index():
    message = """เว็บไซต์นี้จัดทำขึ้นเพื่ออำนวยความสะดวกให้นักศึกษาแผนก IT ที่สนใจในการเล่นบอร์ดเกม โดยเป็นพื้นที่ที่ช่วยให้การผ่อนคลายและสร้างปฏิสัมพันธ์ระหว่างเพื่อน ๆ 
    ผ่านการเล่นเกมที่สนุกและท้าทาย บอร์ดเกมเป็นกิจกรรมที่ไม่เพียงช่วยคลายเครียด แต่ยังพัฒนาทักษะสำคัญที่เป็นประโยชน์ต่อการเรียนด้าน IT เช่น การวางแผนเชิงกลยุทธ์ การแก้ปัญหาอย่างเป็นระบบ 
    และการทำงานร่วมกันในทีม
เว็บไซต์นี้รวบรวมรีวิวและข้อมูลบอร์ดเกมที่เหมาะสำหรับนักศึกษา IT ทุกระดับ ตั้งแต่เกมพื้นฐานไปจนถึงเกมที่ซับซ้อน 
ทำให้คุณสามารถเลือกเกมที่เหมาะกับความสนใจและเวลาของคุณ อีกทั้งยังเป็นแหล่งพบปะและแลกเปลี่ยนความรู้กับเพื่อน ๆ ในแผนก IT ที่มีความชอบในบอร์ดเกมเช่นเดียวกัน"""
    return render_template('Front-Board Game.html', message=message)

if __name__ == '__main__':
    # รันเซิร์ฟเวอร์ Flask บนพอร์ต 5500
    app.run(debug=True, port=5500)